ycsb/cassandra-releases_3-batch_3.11.11_0_18dad79y/0_load.txt
[WARN]  The 'cassandra2-cql' client has been deprecated. It has been renamed to simply 'cassandra-cql'. This alias will be removed in the next YCSB release.
/usr/lib/jvm/java-8-openjdk-amd64/bin/java -cp /home/developer/benchmarks/ycsb/cassandra-binding/conf:/home/developer/benchmarks/ycsb/conf:/home/developer/benchmarks/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/home/developer/benchmarks/ycsb/lib/jackson-core-asl-1.9.4.jar:/home/developer/benchmarks/ycsb/lib/core-0.17.0.jar:/home/developer/benchmarks/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/home/developer/benchmarks/ycsb/lib/HdrHistogram-2.1.4.jar:/home/developer/benchmarks/ycsb/cassandra-binding/lib/netty-common-4.0.33.Final.jar:/home/developer/benchmarks/ycsb/cassandra-binding/lib/cassandra-driver-core-3.0.0.jar:/home/developer/benchmarks/ycsb/cassandra-binding/lib/slf4j-api-1.7.25.jar:/home/developer/benchmarks/ycsb/cassandra-binding/lib/netty-handler-4.0.33.Final.jar:/home/developer/benchmarks/ycsb/cassandra-binding/lib/netty-buffer-4.0.33.Final.jar:/home/developer/benchmarks/ycsb/cassandra-binding/lib/cassandra-binding-0.17.0.jar:/home/developer/benchmarks/ycsb/cassandra-binding/lib/netty-transport-4.0.33.Final.jar:/home/developer/benchmarks/ycsb/cassandra-binding/lib/guava-16.0.1.jar:/home/developer/benchmarks/ycsb/cassandra-binding/lib/metrics-core-3.1.2.jar:/home/developer/benchmarks/ycsb/cassandra-binding/lib/netty-codec-4.0.33.Final.jar site.ycsb.Client -db site.ycsb.db.CassandraCQLClient -s -p hosts=172.31.45.131,172.31.34.70,172.31.32.148 -p cassandra.keyspace=ycsb -p cassandra.writeconsistencylevel=ONE -p workload=site.ycsb.workloads.CoreWorkload -p maxexecutiontime=1800 -threads 64 -p recordcount=2000000 -p operationcount=10000000 -p fieldcount=10 -p fieldlength=500 -p requestdistribution=zipfian -p insertorder=ordered -p readproportion=0.2 -p updateproportion=0.0 -p insertproportion=0.8 -p scanproportion=0.0 -p maxscanlength=1000 -p scanlengthdistribution=uniform -p core_workload_insertion_retry_limit=3 -p core_workload_insertion_retry_interval=3 -load
Command line: -db site.ycsb.db.CassandraCQLClient -s -p hosts=172.31.45.131,172.31.34.70,172.31.32.148 -p cassandra.keyspace=ycsb -p cassandra.writeconsistencylevel=ONE -p workload=site.ycsb.workloads.CoreWorkload -p maxexecutiontime=1800 -threads 64 -p recordcount=2000000 -p operationcount=10000000 -p fieldcount=10 -p fieldlength=500 -p requestdistribution=zipfian -p insertorder=ordered -p readproportion=0.2 -p updateproportion=0.0 -p insertproportion=0.8 -p scanproportion=0.0 -p maxscanlength=1000 -p scanlengthdistribution=uniform -p core_workload_insertion_retry_limit=3 -p core_workload_insertion_retry_interval=3 -load
YCSB Client 0.17.0

Loading workload...
Starting test.
SLF4J: Failed to load class "org.slf4j.impl.StaticLoggerBinder".
SLF4J: Defaulting to no-operation (NOP) logger implementation
SLF4J: See http://www.slf4j.org/codes.html#StaticLoggerBinder for further details.
Maximum execution time specified as: 1800 secs
2021-08-05 18:37:52:367 0 sec: 0 operations; est completion in 0 second 
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2021-08-05 18:38:02:340 10 sec: 59649 operations; 5964.9 current ops/sec; est completion in 5 minutes [INSERT: Count=59661, Max=333055, Min=465, Avg=10015.36, 90=20719, 99=48191, 99.9=321279, 99.99=328447] 
2021-08-05 18:38:12:340 20 sec: 137522 operations; 7787.3 current ops/sec; est completion in 4 minutes [INSERT: Count=77861, Max=436223, Min=475, Avg=8208.47, 90=17007, 99=29375, 99.9=386559, 99.99=435199] 
2021-08-05 18:38:22:340 30 sec: 221223 operations; 8370.1 current ops/sec; est completion in 4 minutes [INSERT: Count=83701, Max=444415, Min=448, Avg=7637.37, 90=16247, 99=27743, 99.9=399359, 99.99=425983] 
2021-08-05 18:38:32:341 40 sec: 306103 operations; 8488 current ops/sec; est completion in 3 minutes [INSERT: Count=84890, Max=419583, Min=413, Avg=7543.94, 90=14751, 99=26863, 99.9=371967, 99.99=415999] 
2021-08-05 18:38:42:340 50 sec: 384508 operations; 7840.5 current ops/sec; est completion in 3 minutes [INSERT: Count=78395, Max=417279, Min=415, Avg=7999.55, 90=14383, 99=29199, 99.9=408575, 99.99=415999] 
2021-08-05 18:38:52:340 60 sec: 460165 operations; 7565.7 current ops/sec; est completion in 3 minutes [INSERT: Count=75660, Max=4313087, Min=384, Avg=8622.43, 90=15175, 99=68223, 99.9=492031, 99.99=742399] 
2021-08-05 18:39:02:340 70 sec: 551846 operations; 9168.1 current ops/sec; est completion in 3 minutes [INSERT: Count=91678, Max=449023, Min=353, Avg=6875.05, 90=14247, 99=29055, 99.9=376063, 99.99=426495] 
2021-08-05 18:39:12:340 80 sec: 630485 operations; 7863.9 current ops/sec; est completion in 2 minutes [INSERT: Count=78639, Max=4616191, Min=352, Avg=8253.66, 90=14215, 99=37151, 99.9=490751, 99.99=1567743] 
2021-08-05 18:39:22:340 90 sec: 720712 operations; 9022.7 current ops/sec; est completion in 2 minutes [INSERT: Count=90227, Max=420863, Min=312, Avg=7087.22, 90=13655, 99=28559, 99.9=395263, 99.99=400639] 
2021-08-05 18:39:32:340 100 sec: 810002 operations; 8929 current ops/sec; est completion in 2 minutes [INSERT: Count=89309, Max=652287, Min=328, Avg=7159.5, 90=13839, 99=32047, 99.9=426239, 99.99=577535] 
2021-08-05 18:39:42:340 110 sec: 905778 operations; 9577.6 current ops/sec; est completion in 2 minutes [INSERT: Count=95757, Max=863743, Min=329, Avg=6476.7, 90=11023, 99=25871, 99.9=470271, 99.99=501503] 
2021-08-05 18:39:52:340 120 sec: 1013754 operations; 10797.6 current ops/sec; est completion in 1 minute [INSERT: Count=107976, Max=501759, Min=356, Avg=6101.14, 90=11023, 99=25055, 99.9=392191, 99.99=399871] 
2021-08-05 18:40:02:340 130 sec: 1104734 operations; 9098 current ops/sec; est completion in 1 minute [INSERT: Count=90984, Max=1844223, Min=347, Avg=7037.98, 90=12383, 99=31295, 99.9=401663, 99.99=419327] 
2021-08-05 18:40:12:340 140 sec: 1205919 operations; 10118.5 current ops/sec; est completion in 1 minute [INSERT: Count=101182, Max=445695, Min=351, Avg=6321.66, 90=11639, 99=25631, 99.9=412671, 99.99=439551] 
2021-08-05 18:40:22:341 150 sec: 1301464 operations; 9554.5 current ops/sec; est completion in 1 minute [INSERT: Count=95549, Max=1336319, Min=328, Avg=6689.23, 90=12775, 99=28463, 99.9=383487, 99.99=397055] 
2021-08-05 18:40:32:340 160 sec: 1400272 operations; 9880.8 current ops/sec; est completion in 1 minute [INSERT: Count=98818, Max=465919, Min=341, Avg=6478.84, 90=12255, 99=29295, 99.9=392447, 99.99=440063] 
2021-08-05 18:40:42:340 170 sec: 1493638 operations; 9336.6 current ops/sec; est completion in 58 seconds [INSERT: Count=93351, Max=577023, Min=326, Avg=6742.07, 90=12231, 99=28063, 99.9=409599, 99.99=491775] 
2021-08-05 18:40:52:340 180 sec: 1592940 operations; 9930.2 current ops/sec; est completion in 46 seconds [INSERT: Count=99302, Max=455167, Min=373, Avg=6539.99, 90=11823, 99=26463, 99.9=408575, 99.99=452351] 
2021-08-05 18:41:02:340 190 sec: 1682285 operations; 8934.5 current ops/sec; est completion in 36 seconds [INSERT: Count=89345, Max=1504255, Min=324, Avg=7163.39, 90=11791, 99=26287, 99.9=391679, 99.99=1499135] 
2021-08-05 18:41:12:340 200 sec: 1776150 operations; 9386.5 current ops/sec; est completion in 26 seconds [INSERT: Count=93891, Max=541695, Min=334, Avg=6813.37, 90=12903, 99=28287, 99.9=425983, 99.99=537087] 
2021-08-05 18:41:22:340 210 sec: 1871967 operations; 9581.7 current ops/sec; est completion in 15 seconds [INSERT: Count=95791, Max=478719, Min=338, Avg=6676.27, 90=12479, 99=30223, 99.9=390143, 99.99=446463] 
2021-08-05 18:41:32:340 220 sec: 1967934 operations; 9596.7 current ops/sec; est completion in 4 second [CLEANUP: Count=1, Max=9, Min=9, Avg=9, 90=9, 99=9, 99.9=9, 99.99=9] [INSERT: Count=95967, Max=532479, Min=342, Avg=6660.27, 90=12575, 99=27071, 99.9=480511, 99.99=530943] 
Could not wait until max specified time, TerminatorThread interrupted.
2021-08-05 18:41:38:262 225 sec: 2000000 operations; 5414.72 current ops/sec; [CLEANUP: Count=63, Max=2215935, Min=1, Avg=35160.33, 90=5, 99=5, 99.9=2215935, 99.99=2215935] [INSERT: Count=32066, Max=446463, Min=327, Avg=4215.79, 90=7383, 99=21647, 99.9=420607, 99.99=428287] 
[OVERALL], RunTime(ms), 225922
[OVERALL], Throughput(ops/sec), 8852.612848682289
[TOTAL_GCS_PS_Scavenge], Count, 934
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 1860
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.8232929949274529
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 934
[TOTAL_GC_TIME], Time(ms), 1860
[TOTAL_GC_TIME_%], Time(%), 0.8232929949274529
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 34611.09375
[CLEANUP], MinLatency(us), 1
[CLEANUP], MaxLatency(us), 2215935
[CLEANUP], 95thPercentileLatency(us), 5
[CLEANUP], 99thPercentileLatency(us), 9
[INSERT], Operations, 2000000
[INSERT], AverageLatency(us), 7082.3792845
[INSERT], MinLatency(us), 312
[INSERT], MaxLatency(us), 4616191
[INSERT], 95thPercentileLatency(us), 17535
[INSERT], 99thPercentileLatency(us), 30303
[INSERT], Return=OK, 2000000